// 1.http 协议和 AJAX
// 2.Dom 事件机制, 事件冒泡和事件捕获

/*
网址组成
    协议 http https
    主机 g.cn zhihu.com
    端口 HTTP 默认端口 80
    路径 下面的 [/] 和 [/question/1213124] 是路径
    
电脑通信是靠ip地址，Ip地址记不住又发明了域名
然后又自动向DNS服务器(domain name sever) 查询域名
对应的 IP 地址

比如 g.cn 可以通过电脑的ping程序查出对应 IP 地址
*/

/*
HTTP 协议
一个传输协议，协议就是双方都遵循的规范
1. 浏览器(客户机)按照固定的格式发送请求到服务器
2. 服务器解析请求，按照规定的格式返回文本数据到浏览器
3. 浏览器解析得到的数据，并做相应的处理

可以用 js  动态抓取内容构建页面
比如动态评论、加载数据
比如天气预报程序
比如壁纸图片库
浏览器提供了使用HTTP协议接受发送数据的接口，名为 AJAX
这是一项重要的技术 也就是 web 2.0 的基石
*/

















