1. 爬虫
2. 爬虫结果的图表化数据分析
3. 小游戏
4. markdown编辑器
5. 音乐播放器
6. 视频播放器
7. todo 便签
8. 博客 前端 + 后端
9. 微信小程序
10. 轮播图

校招
学生才能校招 但是校招未必能强于社招  
新的招聘网站 
拉钩 上面有很多假公司和假数据
猎聘 同上
boss直聘 里面有很多野鸡
老的招聘网站
智联
51 

投简历的策略
海投 (保守起见,每天50起)
不要带感情
小心培训诈骗
外包工作是没有问题的

面试前需要准备好简历上的内容
面试时可以悄悄录音 记录是为了分析面试的不足 好好补全知识

关于公司你有什么要问的啊？
我进来之后要做什么事情啊
 
什么时候开始接触前端：
自学 学了半年到一年

为什么学前端
觉得有趣 有热情

该不该拿offer
一定要拿下来
多份offer 到群里慢慢比较

工作
不存在不会做的工作

代码上传服务器
windows 使用 bitvise

工作之后的规划:
    (1) 规划跳槽，从第一天开始
        规划好自己半年/一年后的状态
        不要对公司/老板有盲目的感恩之心，互利双赢才能持久
    (2) 要设定职业规划,探索职业方向
        要照顾自己的喜好,做喜欢的事情
        要保护好自己的热情(做喜欢的事情,尽量避免被公司的业务避免)
            要符合自己工作的意义
            公务员的工作有意义，但是你不认同也会做着痛苦
    (3) 认清自己的地位
        你做了自己的选择,并不只是运气好
        你只是流水线的员工
        一个公司相当于一个作坊 由前端/后端/设计/产品 完成一个东西
    (4) 个人增值的方式
        把某个技术做精,变成专家级流水工
        坏处就是万一技术被淘汰就跪了
        还有就是鸡蛋放在一个篮子里 选择空间也少
        比如 nokia 和 moto 被裁员的员工
        为了避免这种情况 大家要做流行性高/通用性强的方向
        ios 安卓 就不行
        横跨多个领域
        比如全栈 就是典型的复合型的掏粪工
        Node 是趋势 前端没有必要去接触别的语言
        编程能力是最重要的 市场如果有需求 一夜之间 XX 语言码农就出出来了
        技术和其他领域的结合
        软件 + 医疗
        互联网 +
        如何让别人认识你


    



















