/*
2017/01/14

fe17

1 写简历
    排版要清晰
    技能栏要丰富，这是给 hr 看的
    项目就精心准备 4 5 个界面漂亮的项目(附上截图)
        爬虫
        爬虫结果的图标化数据分析
        小游戏
        markdown 编辑器具
        音乐播放器
        视频播放器
        todo 便签
        博客, 前端 + 后端
        微信小程序
        轮播图
        electron 做的桌面播放器等软件
        
2 投简历
  校招，学生才能校招，但校招也未必强于社招
  新的招聘网站
    拉钩   上面有很多假公司，假数据
          拉钩上面限制每天只能投 10 个简历
          所以你可以注册多个不同的帐号
          这样就可以批量投递了
    猎聘
    boss 直聘用 里面很多野鸡
  老的招聘网站（虽然很多人鄙夷, 但是上面的机会也是很多的）
   智联
   51 job
投简历的站略
    1. 海投
    2. 不要带感情（什么公司都一样）
    3. 小心培训诈骗（特征很明显，注意甄别）
    4. 外包工作是没有问题的
    5. 招聘需求 95% 都是瞎写的，工资是假的，要求也是乱写的，所以你尽管投
    6. 投简历过简历都是运气，不要在意，（100 个有不到 10 个面试拿到 2 个 offer 就很不了起了）

3. 面试
    面试前需要准备好简历上的内容
    面试题主要分为以下几类（我会提供常用问题和答案）
        1 字符串操作，就是上课的字符串系列作业
        2 html css 知识
        3 js 语言的奇奇怪怪的知识
    面试必须记录过程（可以悄悄录音）
    记录过程是为了分析面试的不足，好分析并且改进
    你为什转行业
        热爱 喜欢技术 爸妈不让，兴趣转移
    该不该拿 offer
        一定拿下来
        多份 offer 到群里慢慢比较
        
        
4, 工作
不存在不会做的工作
工作的问题和职业发展规划的问题下节课讲


5, 上传代码到服务器
Widnows 使用 bitvise
Mac 使用 Filezilla
*/

















